[
  {
    "id": 1,
    "name": "Final Fantasy 7 Remake",
    "score": 9.2,
    "platforms": ["PS4", "PS5", "Windows"],
    "image": "FF7.jpg",
    "description": "Experience the reimagined world of Final Fantasy VII, a story of Cloud Strife and his allies who battle the mega-corporation Shinra and the mysterious Sephiroth.",
    "link": "pPXYbJpuVyM",
    "genre": ["RPG", "Action"],
    "release_year": 2020,
    "release_month": 4,
    "publisher": "Square Enix",
    "developer": "Square Enix",
    "rating": "Teen",
    "awards": ["Best RPG 2020", "Game of the Year Nominee"],
    "review_extract": "An exciting reimagining of a classic RPG that brings new life to an unforgettable story, with an engaging combat system and stunning visuals.",
    "review_full": "Final Fantasy 7 Remake takes one of the most beloved RPGs of all time and gives it a complete overhaul. The story remains faithful to the original, but the gameplay is updated with real-time combat, adding a new layer of depth. The visuals are breathtaking, with stunning environments and character designs. The voice acting and soundtrack elevate the experience further. While some long-time fans may miss the original's turn-based system, the remake's fast-paced action more than makes up for it. Overall, this is a must-play for any RPG fan.",
    "review_date": "2024-05-01"
  },
  {
    "id": 2,
    "name": "Elden Ring",
    "score": 9.5,
    "platforms": ["PS4", "PS5", "Windows", "Xbox One", "Xbox Series X/S"],
    "image": "EldenRing.jpg",
    "description": "An epic fantasy adventure that combines open-world exploration with FromSoftware's signature combat, set in the world of the Elden Ring, created by George R.R. Martin.",
    "link": "0uav6zQKiMQ",
    "genre": ["RPG", "Action"],
    "release_year": 2022,
    "release_month": 2,
    "publisher": "Bandai Namco Entertainment",
    "developer": "FromSoftware",
    "rating": "Mature",
    "awards": ["Game of the Year 2022", "Best Game Design"],
    "review_extract": "A groundbreaking open-world RPG that builds on FromSoftware's expertise with challenging gameplay and rich world-building. Elden Ring offers an immersive and rewarding experience.",
    "review_full": "Elden Ring blends the best elements of FromSoftware's previous games like Dark Souls and Bloodborne, adding an expansive open world, dynamic weather systems, and player choice. The game is visually stunning and features a deep lore created by George R.R. Martin. Combat is fluid and challenging, and the world design encourages exploration. Elden Ring offers a true sense of discovery, and the difficulty will keep you coming back for more. It's a tough but fair game that rewards patience and skill.",
    "review_date": "2022-03-01"
  },
  {
    "id": 3,
    "name": "Witcher 3",
    "score": 9.1,
    "platforms": ["PS4", "Windows", "Xbox", "Nintendo Switch"],
    "image": "Witcher.jpg",
    "description": "Geralt of Rivia embarks on a personal journey to find his adopted daughter, with an open-world environment full of monsters, magic, and intricate choices.",
    "link": "VpevTNRK-_M",
    "genre": ["RPG", "Action"],
    "release_year": 2015,
    "release_month": 5,
    "publisher": "CD Projekt",
    "developer": "CD Projekt Red",
    "rating": "Mature",
    "awards": ["Best RPG 2015", "Golden Joystick Award for Best RPG"],
    "review_extract": "An epic RPG with a vast, immersive world and an engaging narrative that explores complex moral choices. Witcher 3 is a must-play for any RPG fan.",
    "review_full": "The Witcher 3 is an open-world RPG that delivers a compelling story, memorable characters, and an incredibly detailed world. Geralt's quest to find his adopted daughter takes him through a world filled with political intrigue, monstrous foes, and magic. The game's side quests are just as engaging as the main story, and every decision you make impacts the world around you. The combat is satisfying, the world is beautiful, and the music is hauntingly atmospheric. With its deep lore and mature themes, Witcher 3 is a landmark achievement in RPGs.",
    "review_date": "2015-06-01"
  },
  {
    "id": 4,
    "name": "Rogue Legacy",
    "score": 8.2,
    "platforms": ["PS4", "PS5", "Windows", "Xbox One", "Xbox Series X/S", "Nintendo Switch", "Mac", "Linux"],
    "image": "RogueLegacy.jpg",
    "description": "A rogue-like, procedurally generated platformer where you play as the heir to a lineage of warriors, each with their unique traits and abilities.",
    "link": "bhcOE-tBxvc",
    "genre": ["Platformer", "Action"],
    "release_year": 2013,
    "release_month": 6,
    "publisher": "Cellar Door Games",
    "developer": "Cellar Door Games",
    "rating": "Everyone 10+",
    "awards": ["Best Indie Game 2013", "Best Action Platformer"],
    "review_extract": "A unique twist on the roguelike genre that offers endless replayability with its procedurally generated levels and quirky character traits.",
    "review_full": "Rogue Legacy takes the roguelike genre and adds a fresh twist by making you play as the heir of your previous character. Each new character inherits unique traits like colorblindness or gigantism, creating fun challenges. The procedurally generated levels ensure that no two runs are the same. The game's mix of platforming and combat is tight, and the pixel art style is charming. The difficulty is punishing, but each failure feels like a learning opportunity. Rogue Legacy is an incredibly addictive game that will keep you coming back for more.",
    "review_date": "2013-07-01"
  },
  {
    "id": 5,
    "name": "God of War (2018)",
    "score": 9.4,
    "platforms": ["PS4", "Windows", "PS5"],
    "image": "GodOfWar4.jpg",
    "description": "Kratos embarks on a journey with his son Atreus, exploring Norse mythology in this action-packed adventure.",
    "link": "x_MtcOznfM4",
    "genre": ["Action", "Adventure"],
    "release_year": 2018,
    "release_month": 4,
    "publisher": "Sony Interactive Entertainment",
    "developer": "Santa Monica Studio",
    "rating": "Mature",
    "awards": ["Game of the Year 2018", "Best Action/Adventure"],
    "review_extract": "A stunning reinvention of the God of War series, offering a captivating story and a new, brutal combat system.",
    "review_full": "God of War (2018) redefines the series with a more grounded narrative, focusing on Kratos' relationship with his son, Atreus. The game mixes intense combat with emotional depth, and the world design is breathtaking. The combat is fluid and satisfying, offering strategic elements with each enemy encounter. The visuals and voice acting are top-notch, and the game's open-world design invites exploration. God of War is a triumph in both storytelling and gameplay.",
    "review_date": "2018-05-01"
  },
  {
    "id": 6,
    "name": "Hades",
    "score": 9.3,
    "platforms": ["PC", "Nintendo Switch", "PS4", "Xbox One"],
    "image": "Hades.jpg",
    "description": "A rogue-like dungeon crawler where you play as Zagreus, the son of Hades, trying to escape the underworld.",
    "link": "NDMXQo_LalQ",
    "genre": ["Action", "Rogue-like"],
    "release_year": 2020,
    "release_month": 9,
    "publisher": "Supergiant Games",
    "developer": "Supergiant Games",
    "rating": "Mature",
    "awards": ["Best Indie Game 2020", "Best Action Game"],
    "review_extract": "An incredibly addictive rogue-like that blends tight combat with a compelling narrative. The dynamic storytelling and character interactions keep you coming back.",
    "review_full": "Hades is a rogue-like dungeon crawler with some of the best combat mechanics in the genre. Each run feels fresh thanks to the variety of weapons, powers, and gods you encounter. The story progresses as you venture deeper into the underworld, revealing more about Zagreus and the other gods. The art style and music are outstanding, and the voice acting is exceptional. Hades is one of the best rogue-likes out there, and its fast-paced combat and rich world are hard to resist.",
    "review_date": "2020-10-01"
  },
  {
    "id": 7,
    "name": "Red Dead Redemption 2",
    "score": 9.8,
    "platforms": ["PS4", "Windows", "Xbox One"],
    "image": "RDR2.jpg",
    "description": "A gripping open-world western adventure that tells the story of Arthur Morgan, a member of the Van der Linde gang, in a time of great change.",
    "link": "yoFvVAMcwOE",
    "genre": ["Action", "Adventure"],
    "release_year": 2018,
    "release_month": 10,
    "publisher": "Rockstar Games",
    "developer": "Rockstar Games",
    "rating": "Mature",
    "awards": ["Game of the Year 2018", "Best Narrative"],
    "review_extract": "An epic tale of life in the wild west, with one of the most immersive open-world experiences and deep, engaging characters.",
    "review_full": "Red Dead Redemption 2 is an open-world masterpiece, capturing the beauty and brutality of the American frontier. The story of Arthur Morgan and the Van der Linde gang is emotional and impactful, with characters that feel deeply human. The game world is alive, with a staggering level of detail in every location. The combat is visceral, and the horse mechanics make you feel truly immersed in the world. Red Dead Redemption 2 is an exceptional game that sets a new standard for open-world experiences.",
    "review_date": "2018-11-01"
  },
  {
    "id": 8,
    "name": "The Last of Us Part II",
    "score": 9.3,
    "platforms": ["PS4", "PS5"],
    "image": "lastOfUsPart2.png",
    "description": "A gripping, emotional story of revenge set in a post-apocalyptic world where Ellie navigates the dangers of a broken society.",
    "link": "QwreMeXlFoY",
    "genre": ["Action", "Adventure"],
    "release_year": 2020,
    "release_month": 6,
    "publisher": "Sony Interactive Entertainment",
    "developer": "Naughty Dog",
    "rating": "Mature",
    "awards": ["Game of the Year 2020", "Best Narrative"],
    "review_extract": "A bold continuation of the first game, offering a harrowing journey with morally complex characters and a gripping story.",
    "review_full": "The Last of Us Part II is a powerful sequel that pushes the boundaries of storytelling in video games. Ellie's journey of revenge is intense and emotional, featuring complex characters and difficult moral choices. The game's mechanics are refined, offering fluid combat and stealth. The graphics and animation are stunning, creating an atmosphere that feels alive. The Last of Us Part II is not just a game; it's a narrative experience that challenges the player in ways few games do.",
    "review_date": "2020-06-01"
  },
  {
    "id": 9,
    "name": "Spider-Man (PS4)",
    "score": 9.0,
    "platforms": ["PS4"],
    "image": "spiderman.jpg",
    "description": "Swing through New York City as Peter Parker, battling iconic villains in this superhero action game.",
    "link": "NG-Mv7cucGo",
    "genre": ["Action", "Adventure"],
    "release_year": 2018,
    "release_month": 9,
    "publisher": "Sony Interactive Entertainment",
    "developer": "Insomniac Games",
    "rating": "Teen",
    "awards": ["Best Action/Adventure 2018"],
    "review_extract": "A fun, fast-paced superhero game that truly makes you feel like Spider-Man with a detailed open world and thrilling combat.",
    "review_full": "Spider-Man for the PS4 delivers one of the best superhero experiences in gaming. The game lets you swing around New York City, fighting crime, and battling iconic villains like the Vulture and Scorpion. The combat system is fluid and rewarding, combining webslinging with acrobatic combat. The story is engaging and well-written, with an emotional core. The open world is detailed and packed with things to do. Overall, it's a game that fans of Spider-Man will love and non-fans will appreciate.",
    "review_date": "2018-09-01"
  },
  {
    "id": 10,
    "name": "Half-Life Alyx",
    "score": 9.3,
    "platforms": ["PC VR"],
    "image": "half_life.jpg",
    "description": "A first-person shooter set in the Half-Life universe, designed for virtual reality, where you take on the role of Alyx Vance in a fight against the alien Combine.",
    "link": "FqnEmmDeGHc",
    "genre": ["FPS", "Action"],
    "release_year": 2020,
    "release_month": 3,
    "publisher": "Valve",
    "developer": "Valve",
    "rating": "Mature",
    "awards": ["Best VR Game 2020", "Best Game Design"],
    "review_extract": "A groundbreaking VR experience that takes the Half-Life series into a new dimension, with immersive gameplay and top-tier visuals.",
    "review_full": "Half-Life Alyx is a revolutionary VR shooter that immerses you in the world of Half-Life like never before. The game's mechanics are designed specifically for VR, with realistic physics and interaction. You can pick up, throw, and manipulate objects in the environment, making combat and exploration feel incredibly tactile. The story is engaging, the atmosphere is tense, and the world design is meticulous. It's one of the best VR games ever made and a must-play for fans of the series.",
    "review_date": "2020-04-01"
  },
  {
    "id": 11,
    "name": "Super Mario Odyssey",
    "score": 9.4,
    "platforms": ["Nintendo Switch"],
    "image": "Super_Mario_Odyssey.jpg",
    "description": "Mario embarks on a globe-trotting adventure to rescue Princess Peach from Bowser in this colorful 3D platformer.",
    "link": "MgR9XBBEKjI",
    "genre": ["Platformer", "Adventure"],
    "release_year": 2017,
    "release_month": 10,
    "publisher": "Nintendo",
    "developer": "Nintendo",
    "rating": "Everyone",
    "awards": ["Best Family Game 2017", "Best Action/Adventure"],
    "review_extract": "A delightful, creative platformer that takes Mario to new places with fresh mechanics and a fun world design.",
    "review_full": "Super Mario Odyssey is a return to the series' 3D platforming roots, with new mechanics and vibrant world design. Mario's hat, Cappy, allows him to possess enemies and objects, adding a unique twist to the gameplay. The game features diverse environments and offers plenty of challenges to keep you entertained. The visuals are bright and colorful, and the soundtrack is catchy. Super Mario Odyssey is a joy to play and one of the best 3D Mario games ever made.",
    "review_date": "2017-10-01"
  },
  {
    "id": 12,
    "name": "Sekiro: Shadows Die Twice",
    "score": 9.0,
    "platforms": ["PS4", "Xbox One", "Windows"],
    "image": "sekiro.jpg",
    "description": "A samurai action-adventure game set in feudal Japan where you play as a lone wolf seeking revenge against his captors.",
    "link": "Od5A36FudD4",
    "genre": ["Action", "Adventure"],
    "release_year": 2019,
    "release_month": 3,
    "publisher": "Activision",
    "developer": "FromSoftware",
    "rating": "Mature",
    "awards": ["Game of the Year 2019", "Best Action/Adventure"],
    "review_extract": "A brutal, rewarding game that mixes stealth and action with deep combat mechanics and a captivating story set in feudal Japan.",
    "review_full": "Sekiro: Shadows Die Twice takes FromSoftware's signature challenging gameplay and applies it to a samurai setting. The combat is precise and unforgiving, with a focus on parrying and counter-attacking. The world is richly detailed, and the story is compelling, exploring themes of loyalty, honor, and revenge. The game's difficulty is high, but each victory feels incredibly rewarding. Sekiro is a masterpiece in action games, offering a unique and unforgettable experience.",
    "review_date": "2019-04-01"
  },
  {
    "id": 13,
    "name": "Minecraft",
    "score": 8.8,
    "platforms": ["PC", "PS4", "Xbox One", "Nintendo Switch", "Mobile"],
    "image": "minecraft.jpg",
    "description": "A sandbox game where you can build, explore, and survive in a blocky world full of adventure.",
    "link": "5oghqTROa7o",
    "genre": ["Sandbox", "Survival"],
    "release_year": 2011,
    "release_month": 11,
    "publisher": "Mojang",
    "developer": "Mojang",
    "rating": "Everyone",
    "awards": ["Best Family Game 2011", "Best Game Design"],
    "review_extract": "A creative and addictive sandbox game that allows players to build anything they can imagine while surviving in a blocky world.",
    "review_full": "Minecraft is one of the most successful and influential games of all time, allowing players to create and explore their own worlds. The game's procedurally generated landscapes offer endless possibilities, and players can build anything from simple houses to complex machines. The survival mode adds an extra layer of challenge, while the creative mode encourages imagination. The simple graphics and music add to the charm, and Minecraft's community has kept it fresh with mods and updates.",
    "review_date": "2011-11-01"
  },
  {
    "id": 14,
    "name": "Overwatch",
    "score": 8.7,
    "platforms": ["PS4", "Xbox One", "Windows", "Nintendo Switch"],
    "image": "overwatch.jpg",
    "description": "A team-based shooter where you choose from a variety of heroes, each with unique abilities, and work with your team to achieve objectives.",
    "link": "fT-HvMPJvhA",
    "genre": ["Shooter", "Action"],
    "release_year": 2016,
    "release_month": 5,
    "publisher": "Blizzard Entertainment",
    "developer": "Blizzard Entertainment",
    "rating": "Teen",
    "awards": ["Best Multiplayer Game 2016", "Best Game Design"],
    "review_extract": "An innovative, colorful team-based shooter with a diverse roster of heroes and fast-paced, tactical gameplay.",
    "review_full": "Overwatch is a team-based first-person shooter that focuses on cooperation and strategy. The game features a roster of unique heroes, each with their own abilities and playstyles. The gameplay is fast-paced and encourages teamwork, as players must work together to capture points or push objectives. The visuals are bright and cartoonish, and the game has an energetic atmosphere. With constant updates and a passionate community, Overwatch remains one of the most popular multiplayer shooters.",
    "review_date": "2016-05-01"
  },
  {
    "id": 15,
    "name": "Fortnite",
    "score": 8.5,
    "platforms": ["PC", "PS4", "Xbox One", "Nintendo Switch", "Mobile"],
    "image": "fortnite.jpg",
    "description": "A battle royale game where 100 players fight to be the last one standing, with building mechanics and a unique art style.",
    "link": "EiQTsdaDYy8",
    "genre": ["Battle Royale", "Shooter"],
    "release_year": 2017,
    "release_month": 9,
    "publisher": "Epic Games",
    "developer": "Epic Games",
    "rating": "Teen",
    "awards": ["Best Multiplayer Game 2018", "Best Ongoing Game"],
    "review_extract": "A fun and addictive battle royale with a focus on both combat and building, keeping players engaged with constant updates and new content.",
    "review_full": "Fortnite is a cultural phenomenon, offering a battle royale experience that blends combat and building mechanics. Players must gather resources, build structures, and fight to be the last one standing. The game's unique art style and cartoony visuals set it apart from other shooters. The constant updates and events keep the game fresh, and its accessibility across platforms makes it a hit with players of all ages. Fortnite is one of the most popular and influential games in recent years.",
    "review_date": "2017-09-01"
  }
]
